SenHe524/stmf407_learn/stm32f407_spi/User/Timer/Timer.c
#include "stm32f4xx.h"                  // Device header

#include "Timer.h"

void Timer_Init(void)
{
	// 外设时钟使能
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	// 选择内部时钟
	TIM_InternalClockConfig(TIM2);
	// 初始化时基单元
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStruct.TIM_Period = 10000 - 1; // 定时器计次到10 * 1000后产生中断，即此时计时了1秒
	TIM_TimeBaseInitStruct.TIM_Prescaler = 8400 - 1; // 84*1000*1000 / ((8400-1)+1) = 10 * 1000 HZ(定时器一秒钟计次10*1000次)
	TIM_TimeBaseInitStruct.TIM_RepetitionCounter = 0;
	// 此函数会在初始化时立马进入一次中断函数以更新预分频的配置
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStruct);
	// 若想不进入，添加如下语句：
	TIM_ClearFlag(TIM2,TIM_FLAG_Update);
	
	// 使能中断
	TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
	// NVIV优先级分组
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	// 启动定时器
	TIM_Cmd(TIM2,ENABLE);
}


// 中断函数模板
//void TIM2_IRQHandler(void)
//{
//	if(TIM_GetITStatus(TIM2,TIM_IT_Update) == SET)
//	{
//		
//		TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
//	}
//}

